In [1]:
import pandas as pd

In [39]:
uriage_data = pd.read_csv(f"./chapter2_data/uriage.csv")
kokyaku_data = pd.read_excel(f"./chapter2_data/kokyaku_daicho.xlsx")
display(uriage_data.head(3))
display(kokyaku_data.head(3))

         purchase_date item_name  item_price customer_name
0  2019-06-13 18:02:34       商品A         100         深井菜々美
1  2019-07-13 13:05:29     商 品 S         nan          浅田賢二
2  2019-05-11 19:42:07     商 品 a         nan          南部慶二

      顧客名       かな  地域                    メールアドレス         登録日
0   須賀ひとみ   すが ひとみ  H市    suga_hitomi@example.com  2018/01/04
1  岡田　 敏也  おかだ としや  E市  okada_toshiya@example.com       42782
2    芳賀 希   はが のぞみ  A市    haga_nozomi@example.com  2018/01/07

In [40]:
display(uriage_data.isnull().sum())
display(uriage_data.describe(include="all").T)
display(kokyaku_data.isnull().sum())
display(kokyaku_data.describe(include="all").T)

purchase_date      0
item_name          0
item_price       387
customer_name      0
dtype: int64

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
purchase_date,2999,2999,2019-06-29 16:41:08,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
item_name,2999,99,商品A,133,NaN,NaN,NaN,NaN,NaN,NaN,NaN
item_price,2612,NaN,NaN,NaN,1296,718,100,700,1300,1900,2600
customer_name,2999,199,島袋友以乃,26,NaN,NaN,NaN,NaN,NaN,NaN,NaN

顧客名        0
かな         0
地域         0
メールアドレス    0
登録日        0
dtype: int64

        count unique                       top freq
顧客名       200    200                     杉田 将也    1
かな        200    200                    あそう りお    1
地域        200      8                        A市   31
メールアドレス   200    200  imura_shunji@example.com    1
登録日       200    174                2017/01/30    4

In [41]:
uriage_data["item_name"].head()
# スペースが入ってたり、小文字だったり、、、

0      商品A
1    商 品 S
2    商 品 a
3      商品Z
4      商品a
Name: item_name, dtype: object

In [42]:
uriage_data["item_price"].head()
# Nanがある、、、

0    100
1    nan
2    nan
3   2600
4    nan
Name: item_price, dtype: float64

In [43]:
# ノック14：商品名の揺れを補正しよう

In [45]:
display( pd.unique(uriage_data["item_name"]) )
display( len(pd.unique(uriage_data["item_name"])) )
#pd.set_option("display.max_row",100)
#uriage_data["item_name"].value_counts()

array(['商品A', '商 品 S', '商 品 a', '商品Z', '商品a', '商品S', '商品 a', '商品V', '商品O',
       '商 品U', '商品L', '商  品V', '商 品O', '商品C', '商品I', '商品r', '商品X', '商品 g',
       '商品R', '商品P', '商品Q', '商品y', '商品 A', '商品N', '商品W', '商 品E', '商品K',
       '商品B', '商品F', '商 品s', '  商品W', ' 商 品 n', '商 品F', '商品D', '商品M',
       '商品Y', '商品U', '商品H', '商品T', '商品J', '商  品O', '商品E', '商  品Q', ' 商品S',
       ' 商品M', '商  品T', '商品G', '商 品G', ' 商品P', ' 商品E', '商 品N', '商 品Y',
       '商品 J', '商品 V', '商品 K', '商 品V', '商 品D', '商 品A', '商品 F', '商品 H',
       '商 品K', '商 品T', '商品 X', '商品 Q', '商 品X', '商 品H', '商 品C', '商品 B',
       '商品 O', '商品 T', '商品v', '商品p', '商品i', '商品 w', '商 品 s', '商 品 q',
       '商品s', '商品l', '商品t', '商品k', '商品g', '商品o', '商品 R', '商品 S', '商 品M',
       '商品j', '商品d', '商品 I', '商品 E', '商品 o', '商品c', '商品 v', '商品e', '商品x',
       '商 品I', ' 商品W', ' 商品X', '商品 M', '商 品P'], dtype=object)

99

In [46]:
# 修正
uriage_data["item_name"] = uriage_data["item_name"].str.upper()
uriage_data["item_name"] = uriage_data["item_name"].str.replace(" ", "")
uriage_data["item_name"] = uriage_data["item_name"].str.replace("　", "")

In [47]:
uriage_data.sort_values(["item_name"], ascending=True)

            purchase_date item_name  item_price customer_name
0     2019-06-13 18:02:34       商品A         100         深井菜々美
1748  2019-05-19 20:22:22       商品A         100          松川綾女
223   2019-06-25 08:13:20       商品A         100           板橋隆
1742  2019-06-13 16:03:17       商品A         100          小平陽子
1738  2019-02-10 00:28:43       商品A         100          松田浩正
...                   ...       ...         ...           ...
2880  2019-04-22 00:36:52       商品Y         nan          田辺光洋
2881  2019-04-30 14:21:09       商品Y         nan          高原充則
1525  2019-01-24 10:27:23       商品Y        2500         五十嵐春樹
1361  2019-05-28 13:45:32       商品Y        2500         大崎ヒカル
3     2019-02-12 23:40:45       商品Z        2600          麻生莉緒

[2999 rows x 4 columns]

In [48]:
display( pd.unique(uriage_data["item_name"]) )
display( len(pd.unique(uriage_data["item_name"])) )

array(['商品A', '商品S', '商品Z', '商品V', '商品O', '商品U', '商品L', '商品C', '商品I',
       '商品R', '商品X', '商品G', '商品P', '商品Q', '商品Y', '商品N', '商品W', '商品E',
       '商品K', '商品B', '商品F', '商品D', '商品M', '商品H', '商品T', '商品J'],
      dtype=object)

26